Repository: slitersr/CS6074MidtermProject
Catalog: messages_*.po
Languages: de

# ensuring legal message
source: [Core Utilities] Validating string:
de: GERMAN [Core Utilities] Validating string:

# established internet connection
source: [Networking] Connected to server:
de: GERMAN [Networking] Connected to server:

# data over network
source: [Networking] Sending data to server (
de: GERMAN [Networking] Sending data to server (

# internet connection lost
source: [Networking] Disconnected
de: GERMAN [Networking] Disconnected

source: [Application] Sending message to '
de: GERMAN [Application] Sending message to '

# text message contents
source: ' with content '
de: GERMAN ' with content '

# text message transmission
source: [Application] Message sent!
de: GERMAN [Application] Message sent!

# retrieving
source: [Application] Getting current messages
de: GERMAN [Application] Getting current messages

# adding to user interface
source: [UI Components] Creating window
de: GERMAN [UI Components] Creating window

# adding to user interface
source: [UI Components] Creating button
de: GERMAN [UI Components] Creating button

# adding to user interface
source: [UI Components] Creating text box
de: GERMAN [UI Components] Creating text box

source: [UI Components] Send button clicked
de: GERMAN [UI Components] Send button clicked

# creating user interface
source: [UI Main] Creating window
de: GERMAN [UI Main] Creating window

source: [UI Main] Setting text fields and sending message
de: GERMAN [UI Main] Setting text fields and sending message

# messenger application user
source: Test User
de: GERMAN Test User

source: This message is being sent from the user interface
de: GERMAN This message is being sent from the user interface

# user closed application
source: [UI Main] Exiting application
de: GERMAN [UI Main] Exiting application

source: [Batch API] Sending a batch of messages
de: GERMAN [Batch API] Sending a batch of messages

# person
source: Test User
de: GERMAN Test User

# chat
source: First message
de: GERMAN First message

# chat
source: Second message
de: GERMAN Second message

# transmitted
source: [Batch API] All messages sent
de: GERMAN [Batch API] All messages sent
